src/InformationRegisters/АдресныйКлассификатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АдресныйКлассификатор</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>52</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АльтернативныеНазвания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипАдресногоЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРайонаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГородаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНаселенногоПунктаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУлицыВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодРегионаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/АдресныйКлассификатор/Forms/ФормаЗаписи/module.bsl
Функция ЗаполнитьКодыУровней()
	
	НовыйКодРегионаВКоде           = Цел(Код / киМаскаРегиона());
	НовыйКодРайонаВКоде            = Цел(Код / киМаскаРайона()) % 1000;
	НовыйКодГородаВКоде            = Цел(Код / киМаскаГорода()) % 1000;
	НовыйКодНаселенногоПунктаВКоде = Цел(Код / киМаскаНасПункта()) % 1000;
	НовыйКодУлицыВКоде             = Цел(Код / киМаскаУлицы())% 10000;
	
	Модифицировали = Ложь;
	
	Если КодРегионаВКоде <> НовыйКодРегионаВКоде Тогда
		КодРегионаВКоде = НовыйКодРегионаВКоде;
		Модифицировали = Истина;
	КонецЕсли;
		
	Если КодРайонаВКоде <> НовыйКодРайонаВКоде Тогда
		КодРайонаВКоде = НовыйКодРайонаВКоде;
		Модифицировали = Истина;
	КонецЕсли;
	
	Если КодГородаВКоде <> НовыйКодГородаВКоде Тогда
		Модифицировали = Истина;
		КодГородаВКоде = НовыйКодГородаВКоде;
	КонецЕсли;
	
	Если КодНаселенногоПунктаВКоде <> НовыйКодНаселенногоПунктаВКоде Тогда
		КодНаселенногоПунктаВКоде = НовыйКодНаселенногоПунктаВКоде;
		Модифицировали = Истина;
	КонецЕсли;
	
	Если КодУлицыВКоде <> НовыйКодУлицыВКоде Тогда
		КодУлицыВКоде = НовыйКодУлицыВКоде;
		Модифицировали = Истина;
	КонецЕсли;
	
	Возврат Модифицировали;
	
КонецФункции

Процедура ОбновлениеОтображения()
	
	ЭлементыФормы.ПолныйАдрес.Заголовок = киПолучитьПолноеНазвание(Код);
	
КонецПроцедуры

Процедура СокращениеНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокСокращений = киПолучитьСписокСокращений(Наименование, ТипАдресногоЭлемента);
	
	Если СписокСокращений <> Неопределено Тогда
		ЭлементСокращения = ВыбратьИзСписка(СписокСокращений,Элемент);
		Если ЭлементСокращения <> Неопределено Тогда
			Сокращение = СокрЛП(ЭлементСокращения.Значение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ЗаполнитьКодыУровней();
	
КонецПроцедуры
